pitzDailyBenchTemplate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0      0       0)      // 0
    (206    0       0)      // 1
    (206    25.4    0)      // 2
    (0      25.4    0)      // 3
    (0      0       10)     // 4
    (206    0       10)     // 5
    (206    25.4    10)     // 6
    (0      25.4    10)     // 7
    (290   -25.4    0)      // 8
    (290    0       0)      // 9
    (290    25.4    0)      // 10
    (206   -25.4    0)      // 11
    (290   -25.4    10)     // 12
    (290    0       10)     // 13
    (290    25.4    10)     // 14
    (206   -25.4    10)     // 15
);

blocks
(
    // Block 0: Inlet / upper channel (x: 0->206, y: 0->25.4)
    hex (0 1 2 3 4 5 6 7)
    (__XCELLS_IN__ __YCELLS_UP__ 1)
    simpleGrading (1 1 1)

    // Block 1: Lower expansion after step (x: 206->290, y: -25.4->0)
    hex (11 8 9 1 15 12 13 5)
    (__XCELLS_OUT__ __YCELLS_LOW__ 1)
    simpleGrading (1 1 1)

    // Block 2: Upper outlet (x: 206->290, y: 0->25.4)
    hex (1 9 10 2 5 13 14 6)
    (__XCELLS_OUT__ __YCELLS_UP__ 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 12 13 9)
            (9 13 14 10)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
            (2 10 14 6)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 15 11)
            (11 15 12 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (1 9 10 2)
            (11 8 9 1)
            (4 7 6 5)
            (5 6 14 13)
            (15 5 13 12)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
